# Insert Rows with Tuples

In [ ]:
from DATA225utils import make_connection
from employee import reset_employee, print_employee

In [ ]:
conn = make_connection(config_file = 'personnel.ini')
cursor = conn.cursor()

reset_employee(conn)

### Insert one row at a time

In [ ]:
sql = ( """
        INSERT INTO employee
        VALUES (%s, %s, %s, %s)
        """
      )

data = (123, 'Jones', 'Mary', 150_000.00)  # tuple

cursor.execute(sql, data)
conn.commit()

#### SQL syntax does not allow `_` in numbers. However, the number `150_000.00` is in the Python code.

### Insert multiple rows

In [ ]:
sql = ( """
        INSERT INTO employee
        VALUES (%s, %s, %s, %s)
        """
      ) 

data = [ (456, 'Smith',  'George', 100_000.00), 
         (789, 'Brown',  'Leslie', 125_000.00), 
         (941, 'Wilson', 'Sidney', 250_000.00)
       ]

cursor.executemany(sql, data)  # NOTE: executemany()
conn.commit()

### Insert specific columns

#### You can also insert with lists.

In [ ]:
sql = ( """
        INSERT INTO employee (first, last, id)
        VALUES (%s, %s, %s)
        """
      ) 

data = ['Frank', 'Schmidt', 604]  # list

cursor.execute(sql, data)
conn.commit()

In [ ]:
print_employee(conn)

In [ ]:
cursor.close()
conn.close()

In [ ]:
# Copyright (c) 2023 by Ronald Mak